dataset_gen/Earlier_Datasets/NS_Gauss_Irr_openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
16320
(
(-0.04562528230583489 0.04596836397717011 0.0)
(-0.09430587804081056 0.04616366892553669 0.0)
(-0.14322783842859893 0.04899789065609459 0.0)
(-0.19570339320405403 0.051803074790224196 0.0)
(-0.24836606513457066 0.05324750261540566 0.0)
(-0.30316133624089087 0.054632102795871884 0.0)
(-0.3579895474475754 0.05552573538234694 0.0)
(-0.41399643768591904 0.05632486515373499 0.0)
...
);

boundaryField
{
    left
    {
        type cyclic;
    }
    right
    {
        type cyclic;
    }
    bottom
    {
        type cyclic;
    }
    top
    {
        type cyclic;
    }
    frontAndBack
    {
        type empty;
    }
    holeWalls
    {
        type noSlip;
    }
}
