dataset_gen/Earlier_Datasets/NS_Gauss_Irr_openfoam/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
16320
(
(0.00390625 0.00390625 0.05)
(0.0117188 0.00390625 0.05)
(0.0195312 0.00390625 0.05)
(0.0273438 0.00390625 0.05)
(0.0351563 0.00390625 0.05)
(0.0429688 0.00390625 0.05)
(0.0507812 0.00390625 0.05)
(0.0585938 0.00390625 0.05)
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    holeWalls
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(0.46875 0.472656 0.05)
(0.46875 0.480469 0.05)
(0.46875 0.488281 0.05)
(0.46875 0.496094 0.05)
(0.46875 0.503906 0.05)
(0.46875 0.511719 0.05)
(0.46875 0.519531 0.05)
(0.46875 0.527344 0.05)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
